## Plan Result (sbox_frontdoor)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pip-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox"
        name                                 = "sdshmcts-sbox"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (11 unchanged attributes hidden)

      + backend_pool {
          + health_probe_name   = "healthProbeSettings-pip-frontend"
          + load_balancing_name = "loadBalancingSettings-pip-frontend"
          + name                = "pip-frontend"

          + backend {
              + address     = "firewall-sbox-int-palo-sdssbox.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "pip-frontend.sandbox.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = false
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-pip-frontend"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-pip-frontend"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      + frontend_endpoint {
          + host_name                               = "pip-frontend.sandbox.platform.hmcts.net"
          + name                                    = "pip-frontend"
          + session_affinity_enabled                = false
          + session_affinity_ttl_seconds            = 0
          + web_application_firewall_policy_link_id = (known after apply)
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "toffee",
              + "pip-frontend",
            ]
            id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox/routingRules/toffeeHttpsRedirect"
          ~ name               = "toffeeHttpsRedirect" -> "pip-frontend"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "pip-frontend"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sds-api-mgmt",
              + "toffee",
            ]
            id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox/routingRules/sds-api-mgmtHttpsRedirect"
          ~ name               = "sds-api-mgmtHttpsRedirect" -> "toffeeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-test-web",
              + "sds-api-mgmt",
            ]
            id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox/routingRules/vh-test-webHttpsRedirect"
          ~ name               = "vh-test-webHttpsRedirect" -> "sds-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web",
              + "vh-test-web",
            ]
            id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox/routingRules/vh-video-webHttpsRedirect"
          ~ name               = "vh-video-webHttpsRedirect" -> "vh-test-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-admin-web",
              + "vh-video-web",
            ]
            id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox/routingRules/vh-admin-webHttpsRedirect"
          ~ name               = "vh-admin-webHttpsRedirect" -> "vh-video-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "portal-sbox",
              + "vh-admin-web",
            ]
            id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox/routingRules/portal-sboxHttpsRedirect"
          ~ name               = "portal-sboxHttpsRedirect" -> "vh-admin-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "darts-portal",
              + "portal-sbox",
            ]
            id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox/routingRules/darts-portalHttpsRedirect"
          ~ name               = "darts-portalHttpsRedirect" -> "portal-sboxHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "darts-portal",
            ]
          + name               = "darts-portalHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "pip-frontend",
            ]
          + name               = "pip-frontendHttpsRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (41 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["pip-frontend"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/sdshmcts-sbox/frontendEndpoints/pip-frontend"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pip-frontend"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "pipfrontendsbox"
      + resource_group_name   = "lz-sbox-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "ManualUploadPathTraversalGeneral"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "../",
                  + "..\\",
                ]
              + match_variable     = "RequestBody"
              + negation_condition = false
              + operator           = "Contains"
              + transforms         = [
                  + "UrlDecode",
                ]
            }
          + match_condition {
              + match_values       = [
                  + "/manual-upload",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = true
              + operator           = "EndsWith"
            }
          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
        }
      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "ManualUploadPathTraversalNonEncode"
          + priority                       = 2
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "..%c0%af",
                  + "..%c1%9c",
                ]
              + match_variable     = "RequestBody"
              + negation_condition = false
              + operator           = "Contains"
            }
          + match_condition {
              + match_values       = [
                  + "/manual-upload",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = true
              + operator           = "EndsWith"
            }
          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
        }
      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "ManualUploadPathTraversalRegex"
          + priority                       = 3
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "([a-z]:\\\\)|(%252e|\\.)(%252e|\\.)(%255c|%252f|\\\\|\\/)",
                ]
              + match_variable     = "RequestBody"
              + negation_condition = false
              + operator           = "RegEx"
              + transforms         = [
                  + "Lowercase",
                ]
            }
          + match_condition {
              + match_values       = [
                  + "/manual-upload",
                ]
              + match_variable     = "RequestUri"
              + negation_condition = true
              + operator           = "EndsWith"
            }
          + match_condition {
              + match_values       = [
                  + "POST",
                ]
              + match_variable     = "RequestMethod"
              + negation_condition = false
              + operator           = "Equal"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "state"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "formCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "court-and-tribunal-hearings-cookie-preferences"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "createAdminAccount"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "session.sig"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "error_description"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "subscriptions"
            }

          + override {
              + rule_group_name = "LFI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "930110"
                }
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":535,"Program":"tfcmt","SHA1":"","Target":"sbox_frontdoor","Vars":{}} -->